model {
  ssd {
    num_classes: 1
    image_resizer {
      fixed_shape_resizer {
        height: 320
        width: 1024
      }
    }
    feature_extractor {
      
      type: "ssd_mobilenet_v1"
      
      depth_multiplier: 0.75
      
      min_depth: 16

      conv_hyperparams {
        regularizer {
          l2_regularizer {
            weight: 3.999999989900971e-07
          }
        }
        initializer {
          random_normal_initializer {
            mean: 0.0
            stddev: 0.009999999776482582
          }
        }
        activation: RELU_6
        batch_norm {
          decay: 0.9900000095367432
          center: true
          scale: true
          epsilon: 0.0010000000474974513
          train: true
        }
      }
      
      override_base_feature_extractor_hyperparams: true
      target_strides: 8
    }
    box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }
    matcher {
      argmax_matcher {
        matched_threshold: 1.0
        unmatched_threshold: 0.35
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
        use_matmul_gather: true
      }
    }
    similarity_calculator {
      iou_similarity {
      }
    }

    box_predictor {
      weight_shared_convolutional_box_predictor {
        conv_hyperparams {
          regularizer {
            l2_regularizer {
              weight: 3.999999989900971e-07
            }
          }
          initializer {
            random_normal_initializer {
              mean: 0.0
              stddev: 0.009999999776482582
            }
          }
          activation: RELU_6
          batch_norm {
            decay: 0.9900000095367432
            scale: true
            epsilon: 0.0010000000474974513
          }
        }
        depth: 256
        num_layers_before_predictor: 1
        kernel_size: 3
        class_prediction_bias_init: -4.599999904632568
      }
    }

    anchor_generator {

      flexible_grid_anchor_generator {
      
        anchor_grid {
          
          base_sizes: 48.0
          aspect_ratios: 1.0
          
          height_stride: 8
          width_stride: 8
          
        }
      }
    }

    post_processing {
      batch_non_max_suppression {
        score_threshold: 0.10000000149011612
        iou_threshold: 0.3
        max_detections_per_class: 100
        max_total_detections: 100
      }
      score_converter: SIGMOID
    }

    normalize_loss_by_num_matches: true

    loss {
      localization_loss {
        weighted_smooth_l1 {
        }
      }
      classification_loss {
        weighted_sigmoid_focal {
          gamma: 2.0
          alpha: 0.25
        }
      }
      classification_weight: 1.0
      localization_weight: 1.0
    }

    encode_background_as_zeros: true
    normalize_loc_loss_by_codesize: true
    inplace_batchnorm_update: true
    freeze_batchnorm: false
  }
}
train_config {

  batch_size: 8

  data_augmentation_options {
    random_adjust_contrast{

      min_delta: 0.9
      max_delta: 1.1
      
    }
  }

  data_augmentation_options {
    random_adjust_brightness{

      max_delta: 0.1
      
    }
  }

  data_augmentation_options {
    random_image_scale {
      min_scale_ratio: 0.9
      max_scale_ratio: 1.1
    }
  }

  optimizer {
    rms_prop_optimizer {
      learning_rate {
        exponential_decay_learning_rate {
          initial_learning_rate: 0.01
          decay_steps: 500
          decay_factor: 0.5
          staircase: false
        }
      }
    }
    use_moving_average: false
  }

  fine_tune_checkpoint: "/media/sml/catalinh/model_zoo/ssd_mobilenet_v1_0.75_depth_300x300_coco14_sync_2018_07_03/model.ckpt"
  
  from_detection_checkpoint: true
  
  num_steps: 5000
  max_number_of_boxes: 16
  
  unpad_groundtruth_tensors: false
}

train_input_reader {
  
  label_map_path: "/media/sml2/catalinh/biomet/data/phase1/workspace/3CL04011088l/resized/1024x512/partitioned/tool_category_9/lmap.pbtxt"
  
  shuffle: true
  num_readers: 8
  
  tf_record_input_reader {

    input_path: "/media/sml2/catalinh/biomet/data/phase1/workspace/3CL04011088l/resized/1024x512/partitioned/tool_category_9/train*.tfr"
  }
  
  shuffle_buffer_size: 64
  filenames_shuffle_buffer_size: 1

  num_prefetch_batches: -1

  max_number_of_boxes: 2
}
eval_config {
  num_visualizations: 0
  metrics_set: "coco_detection_metrics"
  metrics_set: "pascal_voc_detection_metrics"
  use_moving_averages: false
  min_score_threshold: 0.5
  max_num_boxes_to_visualize: 2
}
eval_input_reader {
  label_map_path: "/media/sml2/catalinh/biomet/data/phase1/workspace/3CL04011088l/resized/1024x512/partitioned/tool_category_9/lmap.pbtxt"
  shuffle: false
  num_readers: 8
  tf_record_input_reader {
    input_path: "/media/sml2/catalinh/biomet/data/phase1/workspace/3CL04011088l/resized/1024x512/partitioned/tool_category_9/eval*.tfr"
  }
  num_prefetch_batches: -1
  max_number_of_boxes: 2
}