model {
  faster_rcnn {
    num_classes: 4
    image_resizer {
      fixed_shape_resizer {
        height: 256
        width: 512
      }
    }
    feature_extractor {
      type: "faster_rcnn_inception_v2"
      first_stage_features_stride: 8
      batch_norm_trainable: true
    }
    first_stage_anchor_generator {
      grid_anchor_generator {
        
        height: 256
        width: 256

        height_stride: 8
        width_stride: 8

        scales: 0.21484375
        
        aspect_ratios: 1.0

      }
    }
    first_stage_box_predictor_conv_hyperparams {
      op: CONV
      regularizer {
        l2_regularizer {
          weight: 3.9999998989515007e-05
        }
      }
      initializer {
        truncated_normal_initializer {
          stddev: 0.009999999776482582
        }
      }
    }
    first_stage_box_predictor_kernel_size: 1
    first_stage_box_predictor_depth: 512
    first_stage_minibatch_size: 16
    first_stage_positive_balance_fraction: 0.25
    first_stage_nms_score_threshold: 0.0
    first_stage_nms_iou_threshold: 0.4
    first_stage_max_proposals: 16
    first_stage_localization_loss_weight: 1.0
    first_stage_objectness_loss_weight: 1.0
    initial_crop_size: 10
    maxpool_kernel_size: 2
    maxpool_stride: 2
    second_stage_box_predictor {
      mask_rcnn_box_predictor {
        fc_hyperparams {
          op: FC
          regularizer {
            l2_regularizer {
              weight: 3.9999998989515007e-04
            }
          }
          initializer {
            variance_scaling_initializer {
              factor: 1.0
              uniform: true
              mode: FAN_AVG
            }
          }
        }
        use_dropout: false
        dropout_keep_probability: 0.800000011920929
      }
    }
    second_stage_batch_size: 16
    second_stage_balance_fraction: 0.25
    second_stage_post_processing {
      batch_non_max_suppression {
        score_threshold: 0.10000000149011612
        iou_threshold: 0.20000000298023224
        max_detections_per_class: 100
        max_total_detections: 100
      }
      score_converter: SOFTMAX
    }
    second_stage_localization_loss_weight: 1.0
    second_stage_classification_loss_weight: 1.0
    first_stage_box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }
    first_stage_matcher {
      argmax_matcher {
        matched_threshold: 1.0
        unmatched_threshold: 0.5
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
        use_matmul_gather: true
      }
    }
    first_stage_similarity_calculator {
      iou_similarity {
      }
    }
    second_stage_box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }
    second_stage_matcher {
      argmax_matcher {
        matched_threshold: 1.0
        unmatched_threshold: 0.5
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
        use_matmul_gather: false
      }
    }
    second_stage_similarity_calculator {
      iou_similarity {
      }
    }
  }
}
train_config {

  batch_size: 32

  data_augmentation_options {
    random_adjust_contrast{

      min_delta: 0.9
      max_delta: 1.1
      
    }
  }

  data_augmentation_options {
    random_adjust_saturation{

      min_delta: 0.9
      max_delta: 1.1
      
    }
  }

  data_augmentation_options {
    random_adjust_brightness{

      max_delta: 0.1
      
    }
  }

  data_augmentation_options {
    random_adjust_hue{

      max_delta: 0.1
      
    }
  }

  data_augmentation_options {
    random_image_scale {
      min_scale_ratio: 0.9
      max_scale_ratio: 1.1
    }
  }

  optimizer {
    rms_prop_optimizer {
      learning_rate {
        exponential_decay_learning_rate {
          initial_learning_rate: 0.009999999776482582
          decay_steps: 500
          decay_factor: 0.8999999761581421
          staircase: false
        }
      }
    }
    use_moving_average: false
  }
  gradient_clipping_by_norm: 15.0
  fine_tune_checkpoint: "/media/sml/catalinh/model_zoo/faster_rcnn_inception_v2_coco_2018_01_28/model.ckpt"
  from_detection_checkpoint: true
  num_steps: 10000
  max_number_of_boxes: 4
}
train_input_reader {
  label_map_path: "/media/sml2/catalinh/biomet/data/phase1/3CL04015023/resized/partitioned/g1/1024x512/lmap.pbtxt"
  shuffle: true
  num_readers: 8
  tf_record_input_reader {
    input_path: "/media/sml2/catalinh/biomet/data/phase1/3CL04015023/resized/partitioned/g1/1024x512/train*.tfr"
  }
  shuffle_buffer_size: 512
  filenames_shuffle_buffer_size: 1
  num_prefetch_batches: 1
  max_number_of_boxes: 4
}
eval_config {
  num_visualizations: 0
  metrics_set: "coco_detection_metrics"
  metrics_set: "pascal_voc_detection_metrics"
  use_moving_averages: false
  min_score_threshold: 0.5
  max_num_boxes_to_visualize: 4
}
eval_input_reader {
  label_map_path: "/media/sml2/catalinh/biomet/data/phase1/3CL04015023/resized/partitioned/g1/1024x512/lmap.pbtxt"
  shuffle: false
  num_readers: 8
  tf_record_input_reader {
    input_path: "/media/sml2/catalinh/biomet/data/phase1/3CL04015023/resized/partitioned/g1/1024x512/eval*.tfr"
  }
  num_prefetch_batches: -1
  max_number_of_boxes: 4
}
